k6/results/asis_coupon_issue.txt

         /\      Grafana   /?얄?  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ?얄? 
  /          \   |   (  |  (??  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/coupon_issue_sync.js
        output: InfluxDBv1 (http://localhost:8086)

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m50s max duration (incl. graceful stop):
              * default: Up to 1000 looping VUs for 1m20s over 8 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 0001/1000 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 0001/1000 VUs  0m00.9s/1m20.0s

running (0m01.9s), 0002/1000 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 0002/1000 VUs  0m01.9s/1m20.0s

running (0m02.9s), 0003/1000 VUs, 2 complete and 0 interrupted iterations
default   [   4% ] 0003/1000 VUs  0m02.9s/1m20.0s

running (0m03.9s), 0004/1000 VUs, 3 complete and 0 interrupted iterations
default   [   5% ] 0004/1000 VUs  0m03.9s/1m20.0s

running (0m04.9s), 0005/1000 VUs, 5 complete and 0 interrupted iterations
default   [   6% ] 0005/1000 VUs  0m04.9s/1m20.0s

running (0m05.9s), 0006/1000 VUs, 7 complete and 0 interrupted iterations
default   [   7% ] 0006/1000 VUs  0m05.9s/1m20.0s

running (0m06.9s), 0007/1000 VUs, 11 complete and 0 interrupted iterations
default   [   9% ] 0007/1000 VUs  0m06.9s/1m20.0s

running (0m07.9s), 0008/1000 VUs, 16 complete and 0 interrupted iterations
default   [  10% ] 0008/1000 VUs  0m07.9s/1m20.0s

running (0m08.9s), 0008/1000 VUs, 20 complete and 0 interrupted iterations
default   [  11% ] 0008/1000 VUs  0m08.9s/1m20.0s

running (0m09.9s), 0009/1000 VUs, 25 complete and 0 interrupted iterations
default   [  12% ] 0009/1000 VUs  0m09.9s/1m20.0s

running (0m10.9s), 0010/1000 VUs, 31 complete and 0 interrupted iterations
default   [  14% ] 0010/1000 VUs  0m10.9s/1m20.0s

running (0m11.9s), 0010/1000 VUs, 35 complete and 0 interrupted iterations
default   [  15% ] 0010/1000 VUs  0m11.9s/1m20.0s

running (0m12.9s), 0010/1000 VUs, 40 complete and 0 interrupted iterations
default   [  16% ] 0010/1000 VUs  0m12.9s/1m20.0s

running (0m13.9s), 0010/1000 VUs, 46 complete and 0 interrupted iterations
default   [  17% ] 0010/1000 VUs  0m13.9s/1m20.0s

running (0m14.9s), 0010/1000 VUs, 48 complete and 0 interrupted iterations
default   [  19% ] 0010/1000 VUs  0m14.9s/1m20.0s

running (0m15.9s), 0010/1000 VUs, 54 complete and 0 interrupted iterations
default   [  20% ] 0010/1000 VUs  0m15.9s/1m20.0s

running (0m16.9s), 0010/1000 VUs, 60 complete and 0 interrupted iterations
default   [  21% ] 0010/1000 VUs  0m16.9s/1m20.0s

running (0m17.9s), 0010/1000 VUs, 64 complete and 0 interrupted iterations
default   [  22% ] 0010/1000 VUs  0m17.9s/1m20.0s

running (0m18.9s), 0010/1000 VUs, 68 complete and 0 interrupted iterations
default   [  24% ] 0010/1000 VUs  0m18.9s/1m20.0s

running (0m19.9s), 0010/1000 VUs, 75 complete and 0 interrupted iterations
default   [  25% ] 0010/1000 VUs  0m19.9s/1m20.0s

running (0m20.9s), 0069/1000 VUs, 78 complete and 0 interrupted iterations
default   [  26% ] 0069/1000 VUs  0m20.9s/1m20.0s

running (0m21.9s), 0138/1000 VUs, 89 complete and 0 interrupted iterations
default   [  27% ] 0138/1000 VUs  0m21.9s/1m20.0s

running (0m22.9s), 0207/1000 VUs, 108 complete and 0 interrupted iterations
default   [  29% ] 0207/1000 VUs  0m22.9s/1m20.0s

running (0m23.9s), 0276/1000 VUs, 133 complete and 0 interrupted iterations
default   [  30% ] 0276/1000 VUs  0m23.9s/1m20.0s

running (0m24.9s), 0345/1000 VUs, 162 complete and 0 interrupted iterations
default   [  31% ] 0345/1000 VUs  0m24.9s/1m20.0s

running (0m25.9s), 0414/1000 VUs, 182 complete and 0 interrupted iterations
default   [  32% ] 0414/1000 VUs  0m25.9s/1m20.0s

running (0m26.9s), 0483/1000 VUs, 215 complete and 0 interrupted iterations
default   [  34% ] 0483/1000 VUs  0m26.9s/1m20.0s

running (0m27.9s), 0552/1000 VUs, 247 complete and 0 interrupted iterations
default   [  35% ] 0552/1000 VUs  0m27.9s/1m20.0s

running (0m28.9s), 0621/1000 VUs, 295 complete and 0 interrupted iterations
default   [  36% ] 0621/1000 VUs  0m28.9s/1m20.0s

running (0m29.9s), 0690/1000 VUs, 343 complete and 0 interrupted iterations
default   [  37% ] 0690/1000 VUs  0m29.9s/1m20.0s

running (0m30.9s), 0700/1000 VUs, 391 complete and 0 interrupted iterations
default   [  39% ] 0700/1000 VUs  0m30.9s/1m20.0s

running (0m31.9s), 0700/1000 VUs, 445 complete and 0 interrupted iterations
default   [  40% ] 0700/1000 VUs  0m31.9s/1m20.0s

running (0m32.9s), 0700/1000 VUs, 503 complete and 0 interrupted iterations
default   [  41% ] 0700/1000 VUs  0m32.9s/1m20.0s

running (0m33.9s), 0700/1000 VUs, 550 complete and 0 interrupted iterations
default   [  42% ] 0700/1000 VUs  0m33.9s/1m20.0s

running (0m34.9s), 0682/1000 VUs, 606 complete and 0 interrupted iterations
default   [  44% ] 0682/1000 VUs  0m34.9s/1m20.0s

running (0m35.9s), 0636/1000 VUs, 674 complete and 0 interrupted iterations
default   [  45% ] 0636/1000 VUs  0m35.9s/1m20.0s

running (0m36.9s), 0598/1000 VUs, 729 complete and 0 interrupted iterations
default   [  46% ] 0598/1000 VUs  0m36.9s/1m20.0s

running (0m37.9s), 0548/1000 VUs, 799 complete and 0 interrupted iterations
default   [  47% ] 0548/1000 VUs  0m37.9s/1m20.0s

running (0m38.9s), 0497/1000 VUs, 862 complete and 0 interrupted iterations
default   [  49% ] 0497/1000 VUs  0m38.9s/1m20.0s

running (0m39.9s), 0432/1000 VUs, 931 complete and 0 interrupted iterations
default   [  50% ] 0432/1000 VUs  0m39.9s/1m20.0s

running (0m40.9s), 0374/1000 VUs, 989 complete and 0 interrupted iterations
default   [  51% ] 0374/1000 VUs  0m40.9s/1m20.0s

running (0m41.9s), 0306/1000 VUs, 1058 complete and 0 interrupted iterations
default   [  52% ] 0306/1000 VUs  0m41.9s/1m20.0s

running (0m42.9s), 0235/1000 VUs, 1130 complete and 0 interrupted iterations
default   [  54% ] 0235/1000 VUs  0m42.9s/1m20.0s

running (0m43.9s), 0166/1000 VUs, 1199 complete and 0 interrupted iterations
default   [  55% ] 0166/1000 VUs  0m43.9s/1m20.0s

running (0m44.9s), 0104/1000 VUs, 1261 complete and 0 interrupted iterations
default   [  56% ] 0104/1000 VUs  0m44.9s/1m20.0s

running (0m45.9s), 0049/1000 VUs, 1320 complete and 0 interrupted iterations
default   [  57% ] 0049/1000 VUs  0m45.9s/1m20.0s

running (0m46.9s), 0017/1000 VUs, 1355 complete and 0 interrupted iterations
default   [  59% ] 0017/1000 VUs  0m46.9s/1m20.0s

running (0m47.9s), 0010/1000 VUs, 1370 complete and 0 interrupted iterations
default   [  60% ] 0010/1000 VUs  0m47.9s/1m20.0s

running (0m48.9s), 0010/1000 VUs, 1374 complete and 0 interrupted iterations
default   [  61% ] 0010/1000 VUs  0m48.9s/1m20.0s

running (0m49.9s), 0010/1000 VUs, 1376 complete and 0 interrupted iterations
default   [  62% ] 0010/1000 VUs  0m49.9s/1m20.0s

running (0m50.9s), 0095/1000 VUs, 1381 complete and 0 interrupted iterations
default   [  64% ] 0095/1000 VUs  0m50.9s/1m20.0s

running (0m51.9s), 0194/1000 VUs, 1400 complete and 0 interrupted iterations
default   [  65% ] 0194/1000 VUs  0m51.9s/1m20.0s

running (0m52.9s), 0293/1000 VUs, 1428 complete and 0 interrupted iterations
default   [  66% ] 0293/1000 VUs  0m52.9s/1m20.0s

running (0m53.9s), 0392/1000 VUs, 1475 complete and 0 interrupted iterations
default   [  67% ] 0392/1000 VUs  0m53.9s/1m20.0s

running (0m54.9s), 0491/1000 VUs, 1531 complete and 0 interrupted iterations
default   [  69% ] 0491/1000 VUs  0m54.9s/1m20.0s

running (0m55.9s), 0590/1000 VUs, 1613 complete and 0 interrupted iterations
default   [  70% ] 0590/1000 VUs  0m55.9s/1m20.0s

running (0m56.9s), 0689/1000 VUs, 1688 complete and 0 interrupted iterations
default   [  71% ] 0689/1000 VUs  0m56.9s/1m20.0s

running (0m57.9s), 0788/1000 VUs, 1749 complete and 0 interrupted iterations
default   [  72% ] 0788/1000 VUs  0m57.9s/1m20.0s

running (0m58.9s), 0887/1000 VUs, 1823 complete and 0 interrupted iterations
default   [  74% ] 0887/1000 VUs  0m58.9s/1m20.0s

running (0m59.9s), 0986/1000 VUs, 1898 complete and 0 interrupted iterations
default   [  75% ] 0986/1000 VUs  0m59.9s/1m20.0s

running (1m00.9s), 1000/1000 VUs, 1964 complete and 0 interrupted iterations
default   [  76% ] 1000/1000 VUs  1m00.9s/1m20.0s

running (1m01.9s), 1000/1000 VUs, 2052 complete and 0 interrupted iterations
default   [  77% ] 1000/1000 VUs  1m01.9s/1m20.0s

running (1m02.9s), 1000/1000 VUs, 2121 complete and 0 interrupted iterations
default   [  79% ] 1000/1000 VUs  1m02.9s/1m20.0s

running (1m03.9s), 1000/1000 VUs, 2172 complete and 0 interrupted iterations
default   [  80% ] 1000/1000 VUs  1m03.9s/1m20.0s

running (1m04.9s), 0973/1000 VUs, 2248 complete and 0 interrupted iterations
default   [  81% ] 0973/1000 VUs  1m04.9s/1m20.0s

running (1m05.9s), 0928/1000 VUs, 2319 complete and 0 interrupted iterations
default   [  82% ] 0928/1000 VUs  1m05.9s/1m20.0s

running (1m06.9s), 0886/1000 VUs, 2395 complete and 0 interrupted iterations
default   [  84% ] 0886/1000 VUs  1m06.9s/1m20.0s

running (1m07.9s), 0830/1000 VUs, 2468 complete and 0 interrupted iterations
default   [  85% ] 0830/1000 VUs  1m07.9s/1m20.0s

running (1m08.9s), 0762/1000 VUs, 2546 complete and 0 interrupted iterations
default   [  86% ] 0762/1000 VUs  1m08.9s/1m20.0s

running (1m09.9s), 0714/1000 VUs, 2598 complete and 0 interrupted iterations
default   [  87% ] 0714/1000 VUs  1m09.9s/1m20.0s

running (1m10.9s), 0645/1000 VUs, 2669 complete and 0 interrupted iterations
default   [  89% ] 0645/1000 VUs  1m10.9s/1m20.0s

running (1m11.9s), 0563/1000 VUs, 2751 complete and 0 interrupted iterations
default   [  90% ] 0563/1000 VUs  1m11.9s/1m20.0s

running (1m12.9s), 0489/1000 VUs, 2825 complete and 0 interrupted iterations
default   [  91% ] 0489/1000 VUs  1m12.9s/1m20.0s

running (1m13.9s), 0424/1000 VUs, 2890 complete and 0 interrupted iterations
default   [  92% ] 0424/1000 VUs  1m13.9s/1m20.0s

running (1m14.9s), 0356/1000 VUs, 2958 complete and 0 interrupted iterations
default   [  94% ] 0356/1000 VUs  1m14.9s/1m20.0s

running (1m15.9s), 0281/1000 VUs, 3033 complete and 0 interrupted iterations
default   [  95% ] 0281/1000 VUs  1m15.9s/1m20.0s

running (1m16.9s), 0212/1000 VUs, 3103 complete and 0 interrupted iterations
default   [  96% ] 0212/1000 VUs  1m16.9s/1m20.0s

running (1m17.9s), 0135/1000 VUs, 3181 complete and 0 interrupted iterations
default   [  97% ] 0135/1000 VUs  1m17.9s/1m20.0s

running (1m18.9s), 0061/1000 VUs, 3256 complete and 0 interrupted iterations
default   [  99% ] 0061/1000 VUs  1m18.9s/1m20.0s

running (1m19.9s), 0022/1000 VUs, 3296 complete and 0 interrupted iterations
default   [ 100% ] 0022/1000 VUs  1m19.9s/1m20.0s

running (1m20.9s), 0001/1000 VUs, 3317 complete and 0 interrupted iterations
default ??[ 100% ] 0017/1000 VUs  1m20s

running (1m21.9s), 0001/1000 VUs, 3317 complete and 0 interrupted iterations
default ??[ 100% ] 0017/1000 VUs  1m20s


  ??THRESHOLDS 

    http_req_duration
    ??'p(99)<1000' p(99)=12.27s

    http_req_failed
    ??'rate<0.05' rate=0.00%


  ??TOTAL RESULTS 

    checks_total.......: 3318    40.389781/s
    checks_succeeded...: 100.00% 3318 out of 3318
    checks_failed......: 0.00%   0 out of 3318

    ??荑좏룿 諛쒓툒 ?깃났

    HTTP
    http_req_duration..............: avg=6.77s min=19.37ms med=7.19s max=14.99s p(50)=7.19s p(90)=11.75s p(95)=12.1s  p(99)=12.27s p(99.9)=12.43s
      { expected_response:true }...: avg=6.77s min=19.37ms med=7.19s max=14.99s p(50)=7.19s p(90)=11.75s p(95)=12.1s  p(99)=12.27s p(99.9)=12.43s
    http_req_failed................: 0.00%  0 out of 3318
    http_reqs......................: 3318   40.389781/s

    EXECUTION
    iteration_duration.............: avg=8.76s min=1.01s   med=9.18s max=17.99s p(50)=9.18s p(90)=13.3s  p(95)=14.24s p(99)=15.25s p(99.9)=15.43s
    iterations.....................: 3318   40.389781/s
    vus............................: 1      min=1         max=1000
    vus_max........................: 1000   min=1000      max=1000

    NETWORK
    data_received..................: 607 kB 7.4 kB/s
    data_sent......................: 590 kB 7.2 kB/s



running (1m22.1s), 0000/1000 VUs, 3318 complete and 0 interrupted iterations
default ??[ 100% ] 0000/1000 VUs  1m20s
time="2026-09-14T16:23:38+09:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"